//******************************************************************************
// Part of the Intel(R) QuickAssist Technology Accelerator Abstraction Layer
//
// This  file  is  provided  under  a  dual BSD/GPLv2  license.  When using or
//         redistributing this file, you may do so under either license.
//
//                            GPL LICENSE SUMMARY
//
//  Copyright(c) 2015, Intel Corporation.
//
//  This program  is  free software;  you  can redistribute it  and/or  modify
//  it  under  the  terms of  version 2 of  the GNU General Public License  as
//  published by the Free Software Foundation.
//
//  This  program  is distributed  in the  hope that it  will  be useful,  but
//  WITHOUT   ANY   WARRANTY;   without   even  the   implied   warranty    of
//  MERCHANTABILITY  or  FITNESS  FOR  A  PARTICULAR  PURPOSE.  See  the   GNU
//  General Public License for more details.
//
//  The  full  GNU  General Public License is  included in  this  distribution
//  in the file called README.GPLV2-LICENSE.TXT.
//
//  Contact Information:
//  Henry Mitchel, henry.mitchel at intel.com
//  77 Reed Rd., Hudson, MA  01749
//
//                                BSD LICENSE
//
//  Copyright(c) 2015, Intel Corporation.
//
//  Redistribution and  use  in source  and  binary  forms,  with  or  without
//  modification,  are   permitted  provided  that  the  following  conditions
//  are met:
//
//    * Redistributions  of  source  code  must  retain  the  above  copyright

/// Simulation  mmio size
#define CCIP_MMIO_SIZE              ( 0x120000 )

// Max number of pci bars to scan
#define CCIP_MAX_PCIBAR             5

///=================================================================
/// Enumerations
///=================================================================

/// CCIP Device type ID
enum e_CCIP_DEVTPPE_ID {
   CCIP_DFType_rsvd      = 0x0,
   CCIP_DFType_afu       = 0x1,
   CCIP_DFType_bbb       = 0x2,
   CCIP_DFType_private   = 0x3
};

// FPGA Management Engine (FME)
//-----------------------------

// Device Feature ID
enum e_CCIP_DFL_ID {
   CCIP_FME_DFLID_THERM  = 0x1,
   CCIP_FME_DFLID_POWER  = 0x2,
   CCIP_FME_DFLID_GPERF  = 0x3,
   CCIP_FME_DFLID_GERR   = 0x4,
   CCIP_FME_DFLID_PR     = 0x5,
   CCIP_PORT_DFLID_ERROR = 0x10,
   CCIP_PORT_DFLID_USMG  = 0x11,
   CCIP_PORT_DFLID_PR    = 0x12,
   CCIP_PORT_DFLID_STP   = 0x13
};

// Device Feature revision ID
enum e_CCIP_DFL_rev {
   CCIP_DFL_rev0    = 0x0,
   CCIP_DFL_rev1    = 0x1,
   CCIP_DFL_rev2    = 0x2,
   CCIP_DFL_rev3    = 0x3,
   CCIP_DFL_rev4    = 0x4
};


// AFU power states
enum e_AFU_Power_State {
   AFU_Power_Normal = 0x0,
   AFU_Power_AP1 = 0x1,
   AFU_Power_AP2 = 0x2,
   AFU_Power_AP6 = 0x6
};

// Cache Event codes
enum e_Cache_Event_Code {
   Cache_Read_Hit = 0x0,
   Cache_Write_Hit = 0x1,
   Cache_Read_Miss = 0x2,
   Cache_Write_Miss = 0x3,
   Cache_Rsvd = 0x4,
   Cache_Hold_Req = 0x5,
   Cache_Data_WrtPort_Conten = 0x6,
   Cache_Tag_WrtPort_Conten = 0x7,
   Cache_Tx_Req_stall = 0x8,
   Cache_Rx_Stalls = 0x9,
   Cache_Evictions = 0xA

};

// Fabric event codes
enum e_Fabric_Event_Code {
   Fabric_PCIe0_Read = 0x0,
   Fabric_PCIe0_Write = 0x1,
   Fabric_PCIe1_Read = 0x2,
   Fabric_PCIe1_Write = 0x3,
   Fabric_UPI_Read = 0x4,
   Fabric_UPI_Write = 0x5
};

/// CCI-P port id
enum e_CCIP_Port_Id {
   CCIP_Port_Id0 = 0x0,
   CCIP_Port_Id1 = 0x1,
   CCIP_Port_Rsvd = 0x2,
   CCIP_Port_Rsvd1 = 0x3
};

/// Partial Reconfiguration ID
enum e_FME_PR_REGION_ID {
   CCIP_PR_Region0 = 0x0,
   CCIP_PR_Region1 = 0x1,
   CCIP_PR_rsvd1 = 0x2,
   CCIP_PR_rsvd2 = 0x3

};

/// Partial Reconfiguration status
enum e_CCIP_PORT_PR_status {
   CCIP_PORT_PR_Idle = 0x0,
   CCIP_PORT_PR_RecStart = 0x1,
   CCIP_PORT_DoingPR1 = 0x2,
   CCIP_PORT_DoingPR2 = 0x3,
   CCIP_PORT_DoingPR3 = 0x4,
   CCIP_PORT_DoingPR4 = 0x5,
   CCIP_PORT_DoingPR5 = 0x6,
   CCIP_PORT_PR_complete = 0x7,
   CCIP_PORT_PR_error = 0x8
};

/// Partial Reconfiguration  mega function status codes
enum e_CCIP_PR_Megafun_status {
   CCIP_PR_MF_pwrup = 0x0,
   CCIP_PR_MF_error = 0x1,
   CCIP_PR_MF_crc_err = 0x2,
   CCIP_PR_MF_Incomp_bts_err = 0x3,
   CCIP_PR_MF_opr_inPros = 0x4,
   CCIP_PR_MF_por_pass = 0x5,
   CCIP_PR_MF_rsvd1 = 0x6,
   CCIP_PR_MF_rsvd2 = 0x7
};


/******************************************************************************
 *  FPGA  Header and CSR
 *
 *   Description:
 *
 ******************************************************************************/

/// Device Feature Header CSR
struct CCIP_DFH {

   union {
      btUnsigned64bitInt csr;
      struct {
         btUnsigned64bitInt Feature_ID :12;     // Feature ID

         //enum e_CCIP_DFL_ID Feature_ID :12;     // Feature ID

         btUnsigned64bitInt Feature_rev :4;     // Feature revision
         btUnsigned64bitInt next_DFH_offset :24;// Next Device Feature header offset
         btUnsigned64bitInt rsvd :20;           // Reserved
         btUnsigned64bitInt Type :4;            // Type of Device

         //enum e_CCIP_DEVTPPE_ID Type :4;

      }; //end struct
   }; // end union

}; //end struct CCIP_DFH
CASSERT(sizeof(struct CCIP_DFH) == 8);

/// AFU ID low CSR
struct CCIP_AFU_ID_L {

   union {
      btUnsigned64bitInt csr;
      struct {
         btUnsigned64bitInt afu_id_l :64; // AFU ID low

      }; // end struct
   }; // end union

}; //end struct CCIP_AFU_ID_L
CASSERT(sizeof(struct CCIP_AFU_ID_L) == 8);

/// AFU ID high CSR
struct CCIP_AFU_ID_H {

   union {
      btUnsigned64bitInt csr;
      struct {
         btUnsigned64bitInt afu_id_h :64; // AFU ID low

      }; // end struct
   }; // end union

}; //end struct CCIP_AFU_ID_L
CASSERT(sizeof(struct CCIP_AFU_ID_H) == 8);


/// Next AFU offset CSR
struct CCIP_NEXT_AFU {

   union {
      btUnsigned64bitInt csr;
      struct {
         btUnsigned64bitInt afu_id_offset :24;   // Next AFU DFH byte offset
         btUnsigned64bitInt rsvd :40;            // Reserved

      }; // end struct
   }; // end union

}; // end struct CCIP_NEXT_AFU
CASSERT(sizeof(struct CCIP_NEXT_AFU) == 8);

/// FME Scratch pad CSR
struct CCIP_SCRATCHPAD {
   union {
      btUnsigned64bitInt csr;
      struct {
         btUnsigned64bitInt scratch_pad :64; //Scratch pad Register

      }; // end struct
   }; // end union

}; // end struct CCIP_SCRATCHPAD
CASSERT(sizeof(struct CCIP_SCRATCHPAD) == 8);

/// FPGA Port offset CSR
struct CCIP_PORT_AFU_OFFSET {

   union {
      btUnsigned64bitInt csr;
      struct {
         btUnsigned64bitInt port_offset :24; // Port offset
         btUnsigned64bitInt rsvd1 :8; // Reserved
         btUnsigned64bitInt port_bar :3; // Port BAR
         btUnsigned64bitInt rsvd2 :21; // Reserved
         btUnsigned64bitInt port_arbit_poly :4; // Port Arbitration
         btUnsigned64bitInt port_imp :1; // Port Implemented
         btUnsigned64bitInt rsvd3 :3; // Reserved
      }; // end struct
   }; // end union

}; // end struct CCIP_PORT_AFU_OFFSET
CASSERT(sizeof(struct CCIP_PORT_AFU_OFFSET) == 8);



/******************************************************************************
 *  FPGA Management Engine  Header
 *  CCI-P version =1
 *  CCI-P minor version =0
 *  Type = afu
 *  Header Description:
 *
 ******************************************************************************/
///============================================================================
/// Name: CCIP_FME_HDR
/// @brief   FPGA Management Engine  Header
///  Version: 1
///  Type:  Private
///  Feature: AFU
///============================================================================
struct CCIP_FME_HDR {

   // FME  Header
   struct CCIP_DFH         dfh;               // Offset 0

   // FME afu id  low
   struct CCIP_AFU_ID_L    afu_id_l;         // Offset 0x8

   // FME afu id  high
   struct CCIP_AFU_ID_H    afu_id_h;         // Offset 0x10

   // Next AFU offset
   struct CCIP_NEXT_AFU    next_afu;         // Offset 0x18

   // Reserved
