//******************************************************************************
// This  file  is  provided  under  a  dual BSD/GPLv2  license.  When using or
//         redistributing this file, you may do so under either license.
//
//                            GPL LICENSE SUMMARY
//
//  Copyright(c) 2015-2016, Intel Corporation.
//
//  This program  is  free software;  you  can redistribute it  and/or  modify
//  it  under  the  terms of  version 2 of  the GNU General Public License  as
//  published by the Free Software Foundation.
//
//  This  program  is distributed  in the  hope that it  will  be useful,  but
//  WITHOUT   ANY   WARRANTY;   without   even  the   implied   warranty    of
//  MERCHANTABILITY  or  FITNESS  FOR  A  PARTICULAR  PURPOSE.  See  the   GNU
//  General Public License for more details.
//
//  The  full  GNU  General Public License is  included in  this  distribution
//  in the file called README.GPLV2-LICENSE.TXT.
//
//  Contact Information:
//  Henry Mitchel, henry.mitchel at intel.com
//  77 Reed Rd., Hudson, MA  01749
//
//                                BSD LICENSE
//
//  Copyright(c) 2015-2016, Intel Corporation.
//
//  Redistribution and  use  in source  and  binary  forms,  with  or  without
//  modification,  are   permitted  provided  that  the  following  conditions
//  are met:
//
//    * Redistributions  of  source  code  must  retain  the  above  copyright
//      notice, this list of conditions and the following disclaimer.

   CCIP_Port_Id1 = 0x1,
   CCIP_Port_Rsvd = 0x2,
   CCIP_Port_Rsvd1 = 0x3
};

/// Partial Reconfiguration ID
enum e_FME_PR_REGION_ID {
   CCIP_PR_Region0 = 0x0,
   CCIP_PR_Region1 = 0x1,
   CCIP_PR_rsvd1 = 0x2,
   CCIP_PR_rsvd2 = 0x3

};

/// Partial Reconfiguration status
enum e_CCIP_PORT_PR_status {
   CCIP_PORT_PR_Idle = 0x0,
   CCIP_PORT_PR_RecStart = 0x1,
   CCIP_PORT_PR_ReSet = 0x2,
   CCIP_PORT_WaitFreeze = 0x3,
   CCIP_PORT_WaitPR = 0x4,
   CCIP_PORT_SendFrst_Data = 0x5,
   CCIP_PORT_WaitPRReady = 0x6,
   CCIP_PORT_PushFIFO_IP = 0x7,
   CCIP_PORT_WaitPR_Resp = 0x8,
   CCIP_PORT_PR_Complete = 0x9,
   CCIP_PORT_PR_UnFreeze = 0xA,
   CCIP_PORT_PR_DeAssert = 0xB
};

/// Partial Reconfiguration  mega function status codes
enum e_CCIP_PR_ControllerBlock_status {
   CCIP_PR_CLB_pwrup = 0x0,
   CCIP_PR_CLB_error = 0x1,
   CCIP_PR_CLB_crc_err = 0x2,
   CCIP_PR_CLB_Incomp_bts_err = 0x3,
   CCIP_PR_CLB_opr_inPros = 0x4,
   CCIP_PR_CLB_por_pass = 0x5,
   CCIP_PR_CLB_rsvd1 = 0x6,
   CCIP_PR_CLB_rsvd2 = 0x7
};

///=================================================================
/// IDs used by the devices and objects
///=================================================================

// FPGA Management Engine GUID
#define CCIP_FME_GUIDL              (0x82FE38F0F9E17764ULL)
#define CCIP_FME_GUIDH              (0xBFAf2AE94A5246E3ULL)
#define CCIP_FME_PIPIID             (0x4DDEA2705E7344D1ULL)

#define CCIP_DEV_FME_SUBDEV         ((btUnsigned16bitInt)(-1))
#define CCIP_DEV_PORT_SUBDEV(s)     (s + 0x10)
#define CCIP_DEV_AFU_SUBDEV(s)      (s + 0x20)

#define PORT_SUBDEV(s)              (s - 0x10 )
#define AFU_SUBDEV(s)               (s - 0x20 )

/// FPGA Port GUID
#define CCIP_PORT_GUIDL             (0x9642B06C6B355B87ULL)
#define CCIP_PORT_GUIDH             (0x3AB49893138D42EBULL)
#define CCIP_PORT_PIPIID            (0x5E82B04A50E59F20ULL)

/// AFU GUID
#define CCIP_AFU_PIPIID             (0x26F67D4CAD054DFCULL)

/// Signal Tap GUID
#define CCIP_STAP_GUIDL             (0xB6B03A385883AB8DULL)
#define CCIP_STAP_GUIDH             (0x022F85B12CC24C9DULL)
#define CCIP_STAP_PIPIID            (0xA710C842F06E45E0ULL)


/// Partial Reconfiguration GUID
#define CCIP_PR_GUIDL               (0x83B54FD5E5216870ULL)
#define CCIP_PR_GUIDH               (0xA3AAB28579A04572ULL)
#define CCIP_PR_PIPIID              (0x7C4D41EA156C4D81ULL)


/// Vender ID and Device ID
#define CCIP_FPGA_VENDER_ID         0x8086

/// PCI Device ID
#define PCIe_DEVICE_ID_RCiEP0       0xBCBD
#define PCIe_DEVICE_ID_RCiEP1       0xBCBE

/// VF Device
#define PCIe_DEVICE_ID_VF           0xBCBF

/// QPI Device ID
#define PCIe_DEVICE_ID_RCiEP2       0xBCBC



/// MMIO Space map
#define FME_DFH_AFUIDL  0x8
#define FME_DFH_AFUIDH  0x10
#define FME_DFH_NEXTAFU 0x18


/******************************************************************************
 *  FPGA  Header and CSR
 *
 *   Description:
 *
 ******************************************************************************/

/// Device Feature Header CSR
struct CCIP_DFH {

   union {
      btUnsigned64bitInt csr;
      struct {
         btUnsigned64bitInt Feature_ID :12;      // Feature ID
         btUnsigned64bitInt Feature_rev :4;      // Feature revision
         btUnsigned64bitInt next_DFH_offset :24; // Next Device Feature header offset
         btUnsigned64bitInt eol :1;              // End of Device feature list
         btUnsigned64bitInt rsvd :19;            // Reserved
         btUnsigned64bitInt Type :4;             // Type of Device

      }; //end struct
   }; // end union

}; //end struct CCIP_DFH
CASSERT(sizeof(struct CCIP_DFH) == 8);

/// AFU ID low CSR
struct CCIP_AFU_ID_L {

   union {
      btUnsigned64bitInt csr;
      struct {
         btUnsigned64bitInt afu_id_l :64; // AFU ID low

      }; // end struct
   }; // end union

}; //end struct CCIP_AFU_ID_L
CASSERT(sizeof(struct CCIP_AFU_ID_L) == 8);

/// AFU ID high CSR
struct CCIP_AFU_ID_H {

   union {
      btUnsigned64bitInt csr;
      struct {
         btUnsigned64bitInt afu_id_h :64; // AFU ID low

      }; // end struct
   }; // end union

}; //end struct CCIP_AFU_ID_L
CASSERT(sizeof(struct CCIP_AFU_ID_H) == 8);


/// Next AFU offset CSR
struct CCIP_NEXT_AFU {

   union {
      btUnsigned64bitInt csr;
      struct {
         btUnsigned64bitInt afu_id_offset :24;   // Next AFU DFH byte offset
         btUnsigned64bitInt rsvd :40;            // Reserved

      }; // end struct
   }; // end union

}; // end struct CCIP_NEXT_AFU
CASSERT(sizeof(struct CCIP_NEXT_AFU) == 8);

/// FME Scratch pad CSR
struct CCIP_SCRATCHPAD {
   union {
      btUnsigned64bitInt csr;
      struct {
         btUnsigned64bitInt scratch_pad :64; //Scratch pad Register

      }; // end struct
   }; // end union

}; // end struct CCIP_SCRATCHPAD
CASSERT(sizeof(struct CCIP_SCRATCHPAD) == 8);

/// FPGA Port offset CSR
struct CCIP_PORT_AFU_OFFSET {

   union {
      btUnsigned64bitInt csr;
      struct {
         btUnsigned64bitInt port_offset :24; // Port offset
         btUnsigned64bitInt rsvd1 :8; // Reserved
         btUnsigned64bitInt port_bar :3; // Port BAR
         btUnsigned64bitInt rsvd2 :21; // Reserved
         btUnsigned64bitInt port_arbit_poly :4; // Port Arbitration
         btUnsigned64bitInt port_imp :1; // Port Implemented
         btUnsigned64bitInt rsvd3 :3; // Reserved
      }; // end struct
   }; // end union

}; // end struct CCIP_PORT_AFU_OFFSET
CASSERT(sizeof(struct CCIP_PORT_AFU_OFFSET) == 8);



/******************************************************************************
 *  FPGA Management Engine  Header
 *  CCI-P version =1
 *  CCI-P minor version =0
 *  Type = afu
 *  Header Description:
 *
 ******************************************************************************/
///============================================================================
/// Name: CCIP_FME_HDR
/// @brief   FPGA Management Engine  Header
///  Version: 1
///  Type:  Private
///  Feature: AFU
///============================================================================
struct CCIP_FME_HDR {

   // FME  Header
   struct CCIP_DFH         dfh;               // Offset 0

   // FME afu id  low
   struct CCIP_AFU_ID_L    afu_id_l;         // Offset 0x8

   // FME afu id  high
   struct CCIP_AFU_ID_H    afu_id_h;         // Offset 0x10

   // Next AFU offset
   struct CCIP_NEXT_AFU    next_afu;         // Offset 0x18

   // Reserved
